{"version":"https:\/\/jsonfeed.org\/version\/1","title":"Your blog name","home_page_url":"https:\/\/yoursiteurl.com\/","feed_url":"http:\/\/www.yoursiteurl.com\/blog","author":{"url":"link to your social media","name":"Your Name"},"items":[{"title":"The design principles and goals of sparvk","date_published":"2018-12-28","date_modified":"2018-12-28","id":"http:\/\/sparvk.workrock.in\/aero\/the-design-principles-and-goals-of-sparvk","url":"http:\/\/sparvk.workrock.in\/aero\/the-design-principles-and-goals-of-sparvk","author":{"name":"Your Name"},"content_html":"\n<p>sparvk is an opensource distribution of operating systems. Every unit of sparvk is assembled keeping the following principles in mind:- <\/p>\n<ol>\n<li>\n<p><strong>C<\/strong>onsistent. Sparvk applications should provide a consistent experience to all the users in a team. Consistency is essential to reduce the amount of effort that must be spend to train new staff. Manuals prepared once may be used for years on end without becoming outdated. Updates to software must not break existing workflows. Sparvk aims to become the foundational technology in your organization. On top of which you can create your own business rules and systems.<\/p>\n<\/li>\n<li>\n<p><strong>O<\/strong>ffline. Applications should work in spotty network conditions. We look building systems that can operate in disconnected environments.  A user should not need Internet connectivity to work on documents. They should be able to access their data regardless of the network connectivity. An internet connection may enhance the experience by allowing them to install updates and new applications but in no way should it be a necessity for doing actual work.<\/p>\n<\/li>\n<li><strong>P<\/strong>ortable. Consistency is of no use if it can only be achieved in perfectly staged conditions. Sparvk systems run anywhere. On a server. On your desktop. On your laptop. On your mobile. Through a pendrive. Through an SD card. Or installed on a hard disk. The resources available on a machine will determine how fluidly a sparvk system can run but the core of should be able to run anywhere.  A sparvk system with all the bells and whistles can operate under 1 gb of ram. Granted you won’t be able to open 50 applications at once but you’ll still be able to perform basic functions, get things done.   <\/li>\n<\/ol>\n<p>Besides these fundamental rules there are a few other principles that influence our work <\/p>\n<ul>\n<li>\n<p>Security. Sparvk systems are secure by default. You won’t need to install any antivirus programs. You won’t have to worry about your privacy. You can encrypt entire hard disks so that as long as you protect your master password your data is secure. Even if it gets stolen.<\/p>\n<\/li>\n<li>\n<p>User isolation. Although a sparvk system can be used by <a href=\"\/home\/users-and-sessions-in-sparvk-pod\">multiple accounts<\/a> at once every user will get his own work environment that can’t be tresspassed by other users of the system. Unless you happen to be the administrator every user will only get to see and interact with their own data.<\/p>\n<\/li>\n<li>Gentle on its users. Technology is useless if it can’t be utilized effectively. We build technology so people can use it to simplify their lives. To perform their duties at work more effectively, to be more productive. With sparvk you’ll find yourself in a control, in a state of flow. And if, in the unlikely event,  you ever get stuck you’ll find help from the online community. Forums, youtube videos, blogs, facebook and whatsapp groups, live chats. Plenty of people happy to help you out. A level customer support that is unmatched.     <\/li>\n<\/ul>\n<p>Although we have a set of guidelines that we follow while working on our technology that does not mean that you as a <a href=\"\/aero\/supplier-distribution-kits\">distributor partner<\/a> or as a customer have to honor or even follow these guidelines. And while you have to take care of not violating open source licenses on which sparvk is built , as a user of you are free to do with it as you please. <\/p>\n<h1>Are you ready?<\/h1>"},{"title":"Supplier distribution kits","date_published":"2018-12-26","date_modified":"2018-12-26","id":"http:\/\/sparvk.workrock.in\/aero\/supplier-distribution-kits","url":"http:\/\/sparvk.workrock.in\/aero\/supplier-distribution-kits","author":{"name":"Your Name"},"content_html":"\n<p>At sparvk we are committed to enabling our suppliers with the highest quality of products to help them provide the best service to their customers.   <\/p>\n<p>Since sparvk is a portable distribution of  opensource operating systems it is highly configurable. As a supplier you can request a customized version of sparvk for your customers. sparvk is currently available for use in the following industries:- <\/p>\n<ol>\n<li>Finance , Accounting and Retail. General purpose, cross domain. <\/li>\n<li>Hospitality. Short term rentals, long term leases. Tour and travel operators.  Transport provider. General purpose and cross domain.  <\/li>\n<li>Design. Special flavors available for artistic and engineering design professionals.  <\/li>\n<\/ol>\n<p>We understand that pre prepared varieties can't even begin to cover the diverse range of use cases that people use a computer for. To compensate for that we work hands on with our suppliers to build systems that fall outside the range of use cases we have defined. <\/p>\n<p>The <a href=\"\/aero\/what-is-aero\">aero program<\/a> helps you as a supplier to understand the inner workings of sparvk so you can provide direct support to your customers.  Our distribution kits are not limited to operating systems and applications. It comes in with sales templates instruction manuals and support channels in case things go wrong.  <\/p>\n<p>As a sparvk supplier you'll not only have access to the technology that we have prepared but also to knowledge and research that will allow you to prepare your own distribution technology (eg supplying pre installed sparvk systems on a hard disk instead of a pendrive) . When you work with us you are not just our vendor. You are our partners.  And as partners we encourage you to find new ways of providing value to the customers.  And if that means deviating from sparvk's <a href=\"\/aero\/the-design-principles-and-goals-of-sparvk\">original design goals<\/a>, so be it.  <\/p>\n<h1>Are you ready?<\/h1>"},{"title":"Kickstarter course","date_published":"2018-12-15","date_modified":"2018-12-15","id":"http:\/\/sparvk.workrock.in\/aero\/kickstarter-course","url":"http:\/\/sparvk.workrock.in\/aero\/kickstarter-course","author":{"name":"Your Name"},"content_html":"\n<p>sparvk kickstarter is a crash course that teaches you  how to effectively use opensource operating systems in you daily work life.   <\/p>\n<p><strong> Who this course is for? <\/strong> <\/p>\n<p>sparvk kicstarter course is for anyone who wants to learn what an opensource operating system is. Whether you are an individual or a business, a student or a professional this kickstarter course helps you understand how an opensource operating system can help you increase your productivity and reduce the amount of money you have to spend on proprietary software. <\/p>\n<p>If you're the owner of a business interested in trying out opensource operating systems to reduce your IT costs but don't feel convinced that it can replace\/augment your existing systems then this course will give you all the information you need to reach a decision.  <\/p>\n<p>If you're a system administrator then this course will teach you how to create <a href=\"\/aero\/sparvk-standby-systems\">standby systems<\/a> that you can use to make sure that the IT infrastructure in your organization is always available even if hardware components fail.  <\/p>\n<p>If you are a student who can't pay the high licensing fees of proprietary software this course will teach you how to replace the paid software with opensource programs. <\/p>\n<p>If you're are a hardware manufacturer\/ repair shop this course will teach you how you can package your hardware services together with opensource software to provide greater value to your customers.   <\/p>\n<p><strong> What will you learn from this course? <\/strong> <\/p>\n<ol>\n<li>Installation of the system<\/li>\n<li>The steps you need to follow to create users and administrators for the system<\/li>\n<li>A general overview of what can be achieved on the operating system. <\/li>\n<li>A quick run down of common tasks\n<ul>\n<li>Starting and stopping the system. An overview of the  concepts of sessions and users.  <\/li>\n<li>Connecting to the internet  and browsing on the internet<\/li>\n<li>Creating files and directories<\/li>\n<li>Running programs.<\/li>\n<li>How to perform common business tasks like printing files, working with spreadsheets, presentations etc ?<\/li>\n<\/ul><\/li>\n<li>How to install new packages in the system? <\/li>\n<li>How to backup the files and folders in the system? <\/li>\n<li>The modes of system operation. Operating the system from the GUI and from the terminal.  A few words on system logs<\/li>\n<li>A discussion on Industry specific use cases. <\/li>\n<li>Troubleshooting the system. How to solve problems on your own? How to take the help of community?<\/li>\n<li>Closing remarks on opensource software and how it has shaped the computer industry?     <\/li>\n<\/ol>\n<p><em>Our course is designed to be beginner friendly<\/em><\/p>\n<p><img alt=\"learn how to use an opensource operating system\" src=\"\/images\/1\/5\/f\/9\/6\/15f961c9dd14f45606efaa4eea0e963008280522-grandmother-1822564960720.jpeg\" \/><\/p>\n<p>sparvk kickstarter course is designed to help to organizations make most effective use of IT.  It can help to reskill your  workforce to learn how to use the best tools available in the market today. Most of all the kickstarter course is designed to teach you new way of thinking about computers for you and your organization. <\/p>\n<h1>Are you ready?<\/h1>"},{"title":"What is Aero?","date_published":"2018-12-08","date_modified":"2018-12-08","id":"http:\/\/sparvk.workrock.in\/aero\/what-is-aero","url":"http:\/\/sparvk.workrock.in\/aero\/what-is-aero","author":{"name":"Your Name"},"content_html":"\n<p>Aero is a technology training program that enables your organization to make the most effective use of technology. We do that by:- <\/p>\n<ol>\n<li>Re-skiling your staff to understand and adopt opensource systems.<\/li>\n<li>By introducing processes that can help you manage your growth.  <\/li>\n<li>By providing IT support to keep you moving when you get stuck. <\/li>\n<\/ol>\n<p>Aero exists to reduce the spending of your organization on IT. To help you get more out of your existing investments and to train your staff so that they can use technology to solve problems more effectively. <\/p>\n<p>Aero programs are tailored to the specific needs of your organization. It might be that your staff is quite proficient with computer but they are finding themselves locked in with the proprietary systems. Aero can help by creating a migration plan to move towards a more open environment.  <\/p>\n<p>On the other hand you might find yourself in a situation where you are lagging behind in your technological adoption. Aero can help you there too by patient methodical coaching that gets your staff comfortable with using computers. Even if they have never used one. <\/p>\n<p>More that once we have observed that technology can be intimidating. Our goal at Aero is to remove any apprehension that your people may have about technology. To create an environment that fosters learning. Encouraging people to try new things and start a process of discovery. Finding new ways to solve their problems. <\/p>\n<p>Technology is more than just an app on your phone. It is not just another medium on consumption. It is not just another source of entertainment.  There is more depth to it. Technology can also be used to create something new. We want to help you do that. <\/p>\n<h1>Are you ready?<\/h1>"},{"title":"Sparvk standby systems","date_published":"2018-05-09","date_modified":"2018-05-09","id":"http:\/\/sparvk.workrock.in\/aero\/sparvk-standby-systems","url":"http:\/\/sparvk.workrock.in\/aero\/sparvk-standby-systems","author":{"name":"Your Name"},"content_html":"\n<p>Hardware fails. Sometimes because of something you did and sometimes due to no fault of your own. No matter how careful you are. No matter how many precautions you take. <\/p>\n<p>There are many causes of hardware failure. A corrupted hard drive. A fault in motherboard. A dead memory. Inadequate power supply.<\/p>\n<p>Harddrive failures are the costliest of them all. Although a hard disk is one of the cheapest parts of a computer and yet it is one that is most precious to you. After all, all your data, the hard work of so many years is contained inside the hard disk. You can replace the motherborad. Buy your self a new RAM. Fix the CPU fan. But once the data in the hard disk is lost it can be very difficult to get it back. <\/p>\n<p>Data backup and archival is something that you should be doing a regular basis. There are many strategies for data backup. <\/p>\n<ol>\n<li>You can put it up on the cloud. And download it back when you need it.<\/li>\n<li>You can create your own NFS and have a central repository for your data. <\/li>\n<li>You can backup the data on physical disks keeping multiple copies for each one. <\/li>\n<\/ol>\n<p>Although they are the most convenient method of the 3 strategies cloud backups can get expensive in the long term. As the volume and the access to your data increases your costs tend to increase.\n<img alt=\"opensource operating systems on a harddrive\" src=\"\/images\/9\/0\/3\/1\/5\/903156478d73f9b04f8d00f21b12fae9c11097b5-computer-1574533960720.jpeg\" \/><\/p>\n<p>To reduce the costs of your cloud backups you can set up your own FTP server. Although the initial costs will be high over a period of time you’ll get both the convenience of online backups as well as cost reductions of an in house solution. But to keep such a system running you’d have to spend maintenance costs which depending upon the complexity of your requirements might be minimal or huge. It is not advisable to run an in house server unless you have the required technical expertise. <\/p>\n<p>Cloud backups and setting up your own NFS servers are both examples of online data backups. Where your storage is always available and you can access your data as long as you’re connected to the network. But what if you don’t have a network access? Or what if the network access is too slow for the volume of data you need? <\/p>\n<p>In that case offline backups are the best solution. A physical harddrive is one of the most effective investments you can make to keep your data safe. You can use the hard disks in a couple of ways. You can either <\/p>\n<ol>\n<li>Use one disk per workstation. <\/li>\n<li>Or you can use a single disk across a number of workstations. <\/li>\n<\/ol>\n<p>The effort required to back up the data is minimal. All you need to do is connect the disk and run the backup program on your computer. <\/p>\n<p>It is also a good idea to set a life expectancy to each of the disks that you use on your workstations. For example you may retire a disk after 3 years or after 5 years. Retiring a disk does not mean that you throw it away. It simply means that you no longer write on to this disk and keep it as a read only archive. Something that can be used to lookup an old copy of an important file. <\/p>\n<p>A harddrive that is not being written to\/ not being modified can last for decades. Long enough time for you to extract all the value you can out of your data. After which point you may redeploy these systems into computing tasks that don’t require you to store  any sensitive data. Or example customer support machines where your staff has to respond to inquires from your customer.<\/p>\n<p><strong>Offline standby systems<\/strong><\/p>\n<p>Data loss is one cause of concern when it comes to dealing with disk failures. Another problem is loss of equipment for the duration it takes to restore the original workstation. <\/p>\n<p>There is a better way. By creating ready to boot harddrives you can have multiple copies of a running operating system that can be integrated in any workstation. You can switch harddrives when one fails. You can retire old hard drives early. You can set up new machines quickly and reduce the <a href=\"\/home\/reducing-your-it-costs-with-sparvk-pods\">total cost of ownership<\/a> of your IT systems. So that you can expand your IT infrastructure on demand. <\/p>\n<p>Sparvk aero can help you create offline “available” systems so your production never stops. <\/p>\n<h1>Are you ready?<\/h1>"}]}