{"version":"https:\/\/jsonfeed.org\/version\/1","title":"Your blog name","home_page_url":"https:\/\/yoursiteurl.com\/","feed_url":"http:\/\/www.yoursiteurl.com\/blog","author":{"url":"link to your social media","name":"Your Name"},"items":[{"title":"Accounting for travel companies","date_published":"2018-12-20","date_modified":"2018-12-20","id":"http:\/\/sparvk.workrock.in\/uses\/accounting-for-travel-companies","url":"http:\/\/sparvk.workrock.in\/uses\/accounting-for-travel-companies","author":{"name":"Your Name"},"content_html":"\n<p>The accounting in travel companies can get quite complex due to a number of third party vendors involved. For every trip organized you have to arrange for transport, stay and sightseeing, in addition to other misc. expenses like food. The financial transactions often involves back and forth of commissions to not only travel agents but also other parties involved in the journey of a tourist.  <\/p>\n<p>For a complicated process that requires you to keep track of multiple micro transactions you need an accounting tool that can help you keep your books organized . sparvk pods come with built in support to handle all the accounting requirements for travel companies. Here are a list of things that you'll be able to do with a sparvk pod's travel accounting software:-  <\/p>\n<ol>\n<li>Create customer accounts. You can create accounts not only for individuals but also for corporate travelers. Against each customer account you can create invoices, print them, reconcile them and process payments against them. <\/li>\n<li>Create vendor accounts for your travel service suppliers. Vendor accounts allow you to bill each supplier separately. So for instance if you have a travel package that requires the services of many vendors (eg: hotels, airlines, transport) you can create bills for them separately. The bills created can be charged back to your customers. Or they can be paid by you and invoiced to the customer later.  Vendors also allow you to create credit notes to compensate for bills that were charged incorrectly. <\/li>\n<li>Create employee accounts. Running a travel company is not a one person job. No doubt you'd have your own staff helping you out with the bookings. Or arranging for pickup and drops. The travel accounting applications allow you to create  expense vouchers on behalf of employees. So that if you have any field agents for example you can reimburse them for any spending that they do for travelers (like purchasing food or water bottles or paying toll tax) <\/li>\n<\/ol>\n<p>To make things simpler the trael accounting application comes with a list of common travel expenses built in. So you won't have to spend too much time in data entry and get straight to doing things that matter. <\/p>\n<p><img alt=\"travel accounting software\" src=\"\/user\/pages\/03.uses\/accounting-for-travel-companies\/notebook-614213_960_720.jpg\" \/><\/p>\n<p>The business side of the travel accounting software would help you manage your most common accounting tasks. Besides that sparvk travel accounting  can help you <\/p>\n<ul>\n<li>Create scheduled transactions for recurring payments (like salaries or rent etc) <\/li>\n<li>View reports and charts that give you a high level overview of the company performance. <\/li>\n<li>Create and track quotations. Create budgets. Manage multiple books from a single application. <\/li>\n<\/ul>\n<p>A good accountant can help you manage your books effectively.  sparvk pod's accounting system makes sure that your bookkeepers have the technology that they can trust on to make their life easier. <\/p>\n<h1>Try it you'll like it<\/h1>"},{"title":"An operating system for housing professionals","date_published":"2018-12-14","date_modified":"2018-12-14","id":"http:\/\/sparvk.workrock.in\/uses\/an-operating-system-for-housing-professionals%20","url":"http:\/\/sparvk.workrock.in\/uses\/an-operating-system-for-housing-professionals%20","author":{"name":"Your Name"},"content_html":"\n<p>Property management is no easy task. You have to deal with a 100 things, all at\nonce. Not only are you responsible for daily upkeep of your property but you\nalso have to keep all your residents happy and engaged. A 100% satisfaction rate\nis something that is difficult to achieve. No matter how good you are at your\njob you will miss things. We understand the challenges involved in housing. <\/p>\n<p>To help you become more effective in overcoming these challenges we've built\nsparvk a portable distribution of opensource operating system that comes with:- <\/p>\n<ul>\n<li>A personal information manager that allows you to keep all your contacts in\none place.<\/li>\n<li>Calendering application that lets you schedule your most important tasks by\nthe day, month and year.Never miss an appointment again. <\/li>\n<li>A <a href=\"\/home\/creating-invoices-with-gnu-cash\">digital accounts book<\/a> allowing you to manage your cash assets,\nliabilities, income and expenses. You can even schedule rent invoices for your\ntenants ahead of time so that you don't miss a collection. <\/li>\n<\/ul>\n<p>Best of all you won't have to depend upon an Internet connection to access your\ndata. Our selected applications for property managers work <a href=\"\/home\/technology-that-works-offline\">offline<\/a>. So you\ncan find what you need even if there is no internet connection.<\/p>\n<p><img alt=\"software tools for real estate professionals\" src=\"\/images\/4\/7\/d\/b\/e\/47dbe72da55fb72cb816aa4af0ef915a6c06c836-realestate.jpeg\" \/><\/p>\n<p>As a property manager you have to work with documents all the time. Whether it\nis the Ids or it is the agreements you have to keep records\nof all transactions. Filing, tagging, archiving is a very time consuming task\nthat often detracts you from more pressing issues like servicing your existing\ncustomers or working towards acquiring new ones. <\/p>\n<p>sparvk helps you digitize your records and save them as files on a computer.\nThe sparvk file system comes with tools that allow you to classify your files\nin directories. Automatically back them up on a remote host. Multiple levels of\nsecurity that allows you to :- <\/p>\n<ol>\n<li>Restrict the access to files and directories<\/li>\n<li>Encrypt the files on the hard drive. <\/li>\n<li>Share a single computer with <a href=\"\/home\/users-and-sessions-in-sparvk-pod\">multiple users<\/a> reducing the costs of your\nIT infrastructure. <\/li>\n<\/ol>\n<p>With desktop publishing apps you can create marketing campaigns that can be\nattached as a part of an email news letter or sent out to your prospects as\nbrochures ( <em>In one study it was found that direct mail brochures are still the\nnumber one method from which prospects source product information <\/em>). <\/p>\n<p>Spreadsheets allow you to manage all kinds of data. Whether it is to keep a\nrecord of all the queries from your residents.\nOr it is to note down a list of all the prospects\nspreadsheets provide you with a familiar interface for tracking your data.\nSomething that anyone can use without formal training. <\/p>\n<p>This is where the operating system is at its best. As a property manager you've\ngot more important things to do that fiddling about with the computer.\nWhen you boot sparvk you'll find something that is familiar and yet more powerful than\nanything you've used. <\/p>\n<p>sparvk is a portable distribution of opensource operating systems and tools.\nYou don't have to pay any recurring licensing fees to use it. sparvk can\nsupport your team of housing professionals across the entire portfolio of\nproperties by providing a standardized enjoyable computing experience. <\/p>\n<h1>Try it you'll like it<\/h1>"},{"title":"Learning tool for students, children and adults","date_published":"2018-12-11","date_modified":"2018-12-11","id":"http:\/\/sparvk.workrock.in\/uses\/learning-tool-for-students-children-and-adults","url":"http:\/\/sparvk.workrock.in\/uses\/learning-tool-for-students-children-and-adults","author":{"name":"Your Name"},"content_html":"\n<p>A basic computer education is required today to effectively work in any discipline. Whether you're a doctor or a lawyer or an teacher you will need to use computers for your day to day tasks.  The actual use may be as simple as responding to emails or it may be as complex as designing drafts for mechanical components. Proficiency in computers means an increased productivity in your work and improved prospects of getting a job. <\/p>\n<p>Unfortunately though many of the proprietary systems that  are used in the industry today are out of reach to the young people due to their high proprietary costs.  While a fledgling business may be able to afford these tools is difficult for educational institutes , students and hobbyists to be able to pay for the high licencing fees. <\/p>\n<p>Another problem is presented by the shared hardware. It may be that a single computer lab has to provide access to multiple students studying different courses. A mechanical engineering student might be using the same lab that a electronic engineering student does. From the point of view of hardware it is cost effective to share the resources.  After all its not like a workstation is occupied all day. Such a sharing model does indeed lead to a more efficient utilization of the machines. But when it comes to the applications running on a system things do get a bit unmanageable. <\/p>\n<p>As a college expands by adding more disciplines the strain on hardware increases. While the ME student might want to use CAD tools, electronic engineering student would want to use tools for designing chips or for simulating an electonic circuit.<\/p>\n<p>Each tool comes with its own quirks. Having multiple such tools on the same machine without any logical separation between access leads to confusion or in severe cases a data loss. We not only need multiple people to use the same hardware but we also need keep the data and applications for each user separate.   <\/p>\n<p>As a rundown of what we've discussed so far is we need tools that are:- <\/p>\n<ol>\n<li>Free and non proprietary to save costs<\/li>\n<li>Can be used on shared hardware resources for efficient machine utilization  <\/li>\n<li>Still provides an personalized experience to the user to prevent any confusion and data loss.      <\/li>\n<\/ol>\n<h2>How sparvk helps?<\/h2>\n<p>Sparvk is a portable distribution of debian based opensource operating system. It is opensource (free \/ non proprietary \/ community supported) that can run off a pendrive. <\/p>\n<p>Advantages? Well here you go:-  <\/p>\n<ol>\n<li>Extremely flexible in how you run the system. Create multiple usb sticks and assign it to students to run it live.  Install multiple operating systems simultaneously on a single computer.  Run it with other operating systems. The choices are unlimited here. <\/li>\n<li>A simplified per user directory partitioning giving each user of the system his own workspace on the system. So even if you go with one \"operating system per computer\" multiple you can create multiple users for the system. <\/li>\n<li>Thousands of packages available free of cost. Any imaginable problem you can think of there'd be a package already for that.  <\/li>\n<\/ol>\n<h2>What kind of learning tools are available?<\/h2>\n<p>All kinds! <\/p>\n<p>Looking for CAD tools? Try free cad or libre cad\nLooking for floor planning tools? How about sweet home 3d?\nWant some graphic designing software? Well there's inkscape and gimp and blender and well a lot more.\nWant to try some programming? Choose your language pthon, lua, c, java and more\nInterested in getting your hands dirty with some AI tools . We've got you covered here too. <\/p>\n<p><img alt=\"opensource operating system for teachers\" src=\"\/images\/5\/e\/5\/0\/a\/5e50a278e6bb070e553b03f7cd127b5522232589-dawn-1840298960720.jpeg\" \/><\/p>\n<p>Sparvk makes for an excellent tool for learning computers because its cheap, reusable and portable. And whats more not only can you use it to learn computer you can also use it to learn from computers .<\/p>\n<p>YES!<\/p>\n<p>Programs that come packaged in with sparvk have been built upon decades of work by community. And the people who have built these applications have compiled in a lot of knowledge into their software. Say you've always been interested in floor planning but you never knew where to start. No problem simply download a floor planning app like sweethome 3d and follow along with their in built examples. Then take it a step forward by planning your room. Then your home. And then your city. Share your plan files with other people. let them simulate your designs on their own computer and feel the magic of your design.   <\/p>\n<p>With sparvk there's an endless list of things that you can do. Your only limit is your imagination. <\/p>\n<h1>Try it you'll like it<\/h1>"},{"title":"Consistent computing expereince for franchises with sparvk","date_published":"2018-12-05","date_modified":"2018-12-05","id":"http:\/\/sparvk.workrock.in\/uses\/consistent-computing-experience-for-franchises-with-sparvk","url":"http:\/\/sparvk.workrock.in\/uses\/consistent-computing-experience-for-franchises-with-sparvk","author":{"name":"Your Name"},"content_html":"\n<p>One of the great things about computer technology is that once you set it up it can be replicated consistently across any number of machines. It works predictably, reliably and  regularly.  Predictability and regularity are two key requirements for the success of any franchise. <\/p>\n<p>As a franchiser you want your franchisees to be able to implement key process necessary to provide a level of service that is up to the standards of your brand. New franchises face a different set of challenges that must be addressed to ensure first their survival and then a smooth functioning of day to day operations. These challenges are:- <\/p>\n<ol>\n<li>Understanding and satisfying customer demand day in and day out. <\/li>\n<li>Making sure that they well provisioned to satisfy the demands of their customers. Work that happens behind the scenes becomes just as important as the work that happens on the front lines.  <\/li>\n<li>Tracking some key metrics that indicate the health of their business. <\/li>\n<\/ol>\n<p>Now all businesses face these challenges at some point in their life. From a franchise however the expectations are a lot higher due to the brand name  associated and the licensing fees involved. What can you do as the owner of a franchise to overcome these obstacles? <\/p>\n<p>A lot of things. To list a few<\/p>\n<ol>\n<li>Implement digital accounting system across each franchise setting a standard bookkeeping practice in for all the franchises. <\/li>\n<li>Create self learning  programs that can increase the on boarding speed for new hires which can be critical during the initial stages of the business. <\/li>\n<li>Building systems that can track the key performance indicators and communicate these metrics with the stakeholders.  <\/li>\n<\/ol>\n<p>The list can go on and one. <\/p>\n<p>Technology can help in the implementation of these processes on behalf of a franchiser to help them get into business a lot quicker. However for a technology like this to be adopted it must be consistent, well understood so that it feels natural to their operators. <\/p>\n<p><img alt=\"Desktop technology for franchises\" src=\"\/images\/9\/1\/9\/f\/6\/919f65479c583f3f5fb6a016c0dcaf99f549cf6a-agreement-2548138960720.jpeg\" \/><\/p>\n<p>Sparvk provides a solid foundation on which you can base the IT infrastructure of your franchise. <\/p>\n<p>Sparvk pods require a minimal hardware to run (in fact it can run off a USB stick). The opensource components of sparvk are well tested and accepted by the community . For a franchise sparvk provides <\/p>\n<ul>\n<li>An <a href=\"\/home\/benefits-of-gnucash-and-how-to-install-it-on-a-sparvk-pod\">accounting module<\/a> that allows you to track income, expenses, liabilities, assets and equity. The application is easy to learn and comes with a in built manual that you can refer in case you get stuck. <\/li>\n<li>Calendering components to keep your entire staff organized. Documents and spreadsheets to keep all your data in neatly packed in one place. <\/li>\n<li>Communication tools. Email clients to handle all your customer support tickets. <\/li>\n<\/ul>\n<p>Sparvk has no licensing fees so you don't have to pay an yearly \"maintenance\" in order to keep the system running. You get it once and its yours forever. As you expand your business your <a href=\"\/home\/reducing-your-it-costs-with-sparvk-pods\">total cost of ownership<\/a> for the IT infrastructure will actually go down.<\/p>\n<h1>Try it you'll like it<\/h1>"},{"title":"General Uses","date_published":"2018-12-04","date_modified":"2018-12-04","id":"http:\/\/sparvk.workrock.in\/uses\/general-uses","url":"http:\/\/sparvk.workrock.in\/uses\/general-uses","author":{"name":"Your Name"},"content_html":"\n<p>A sparvk pod provides a portable desktop operating system experience to its user enabling them to perform everyday computing tasks. Create documents, organize files, read and respond to emails and work on the internet. <\/p>\n<p>The general utility functions of sparvk makes it an ideal tool for a large number of industries that have to manage documents on a daily basis. Being a low maintenance application, your team can focus on getting things done rather wasting time in getting the (<em>stupid!<\/em>) computer to work. <\/p>\n<p>For small businesses with no support of an IT team sparvk is an easy to use DIY computer administration software. Sparvk can be used in both customer facing as well as the back office departments of the organization:- <\/p>\n<ol>\n<li>\n<p><strong>Customer support<\/strong> Sparvk can be used to build the IT infrastructure for your customer support staff. Since there is no recurring licencing fee involved the <a href=\"\/home\/reducing-your-it-costs-with-sparvk-pods\">total cost of ownership<\/a> for sparvk desktop is significantly lesser than what you’re used to paying. A vanilla install of sparvk should be enough to provide your customer support agent with all the tools he needs to do his job.<\/p>\n<\/li>\n<li><strong>Back Office<\/strong> Sparvk can be deployed for your administrative team handling documents, accounts and other day to day operations. Sparvk’s <a href=\"\/home\/technology-that-works-offline\">offline capabilities<\/a> ensure that the productivity of your team is never compromised. <\/li>\n<\/ol>\n<p>A vanilla sparvk pod provides a solid foundation on which you can base your IT infrastructure on. The distribution comes with a number of programs that can be installed as required to make it more suitable for use in specific scenarios. Here’s a brief rundown of them. <\/p>\n<ol>\n<li><strong>Commerce<\/strong> <a href=\"\/home\/benefits-of-gnucash-and-how-to-install-it-on-a-sparvk-pod\">GnuCash<\/a> the free and opensource accounting system can be installed if you want to use sparvk for your small business.<\/li>\n<li><strong>Manufacturing and Design<\/strong> Sparvk distribution provides free and opensource CAD tools that can be used to create complex machine designs and plan layouts for industries. There are programs that help in microchip designs. <\/li>\n<li><strong>Architecture<\/strong> For architects there are free and opensource floor planning tools. For civil engineers there is mapping software as well as software for designing buildings. <\/li>\n<li><strong>Art<\/strong> For artists there are tools for drawing and animating. There are tools for remixing video and audio. <\/li>\n<li>\n<p><strong>General administration<\/strong>  It's hard to match the power and simplicity of sparvk when it comes handling your day to day operations. Sparvk provides you with calendars for managing bookings and scheduling. Tools for project planning, word processing , spreadsheets, emails that can be used in the front desk of a hotel\/office.    <\/p>\n<p>Since sparvk pod can run off a usb disk it can be used as a backup system that can be used when the main machines break down or get corrupted. As long as your hardware is intact you can boot sparvk on it and start working.  Sparvk is based upon decades of work by the opensource community across the world. Anything that you can think of, sparvk can do it. <\/p>\n<\/li>\n<\/ol>\n<h1>Try it you’ll like it<\/h1>"}]}